Revit 2024 API
IExternalApplication Members
The IExternalApplication type exposes the following members.
Methods
Name | Description
OnShutdown
Implement this method to execute some tasks when Autodesk Revit shuts down.
OnStartup
Implement this method to execute some tasks when Autodesk Revit starts.
See Also
IExternalApplication Interface
Autodesk.Revit.UI Namespace